[
  {
    "title": "Energy majors lock onto Southeast Asia in race for more gas for AI power demand",
    "link": "https://www.thestar.com.my/tech/tech-news/2025/06/18/energy-majors-lock-onto-southeast-asia-in-race-for-more-gas-for-ai-power-demand",
    "summary": "KUALA LUMPUR (Reuters) -Energy majors are pouring money into gas exploration and production in Malaysia and Indonesia to meet rising power demand from growing populations and a proliferation of data centres in the region. Read full story",
    "sentiment_score": 0.4939,
    "published": "2025-06-18 07:44:00"
  },
  {
    "title": "AI to reduce Amazon’s corporate workforce: CEO Andy Jassy in internal memo",
    "link": "http://economictimes.indiatimes.com/tech/technology/ai-to-reduce-amazons-corporate-workforce-ceo-andy-jassy-in-internal-memo/articleshow/121926551.cms",
    "summary": "Amazon CEO Andy Jassy has told staff that AI will gradually reduce the company’s corporate workforce. In an internal memo, he highlighted efficiency gains from AI integration across operations.",
    "sentiment_score": 0.3182,
    "published": "2025-06-18 07:43:50"
  },
  {
    "title": "Comelec division cancels registration of Duterte Youth",
    "link": "https://www.rappler.com/philippines/elections/comelec-division-cancels-registration-duterte-youth/",
    "summary": "The Comelec 2nd Division says the grounds for cancellation are related to lacking requirements for the poll body's rules for accrediting party-list groups",
    "sentiment_score": 0.0,
    "published": "2025-06-18 07:43:26"
  },
  {
    "title": "Cloud Sustainability Market Report 2025-2034: Industry Overview, Trends, And Forecast Analysis",
    "link": "https://www.openpr.com/news/4071774/cloud-sustainability-market-report-2025-2034-industry",
    "summary": "We've updated all our reports with current data on tariff changes, trade developments, and supply chain shifts affecting key industries.What Is the Current Cloud Sustainability Market Size and Its Estimated Growth Rate?Over the past few years, the cloud sustainability market",
    "sentiment_score": 0.3818,
    "published": "2025-06-18 07:43:09"
  },
  {
    "title": "The future of enterprise comms is simple: use locally and act globally. Here's what's next",
    "link": "https://www.techradar.com/pro/the-future-of-enterprise-comms-is-simple-use-locally-and-act-globally-heres-whats-next",
    "summary": "Why global UC but local telco? Discover how cloud telephony is unifying enterprise communications worldwide.",
    "sentiment_score": 0.0,
    "published": "2025-06-18 07:43:08"
  }
]